<?php
// +----------------------------------------------------------------------
// | RXThinkCMF框架 [ RXThinkCMF ]
// +----------------------------------------------------------------------
// | 版权所有 2017~2020 南京RXThinkCMF研发中心
// +----------------------------------------------------------------------
// | 官方网站: http://www.rxthink.cn
// +----------------------------------------------------------------------
// | Author: 牧羊人 <1175401194@qq.com>
// +----------------------------------------------------------------------

namespace app\common\model;

/**
 * 岗位-模型
 * @author 牧羊人
 * @since 2020/11/14
 * Class Position
 * @package app\common\model
 */
class Position extends BaseModel
{
    // 设置数据表名
    protected $name = "position";
}
