<?php
// +----------------------------------------------------------------------
// | RXThinkCMF框架 [ RXThinkCMF ]
// +----------------------------------------------------------------------
// | 版权所有 2017~2020 南京RXThinkCMF研发中心
// +----------------------------------------------------------------------
// | 官方网站: http://www.rxthink.cn
// +----------------------------------------------------------------------
// | Author: 牧羊人 <1175401194@qq.com>
// +----------------------------------------------------------------------

namespace app\common\event;


use app\common\model\ActionLog;

/**
 * 用户日志时间
 * @author 牧羊人
 * @since 2020/11/21
 * Class AdminLog
 * @package app\event
 */
class UserLog
{

    /**
     * 执行句柄
     * @author 牧羊人
     * @since 2020/11/21
     */
    public function handle()
    {
        if (request()->isPost()) {
            ActionLog::record();
        }
    }
}
